{
    "users": [
        {
            "id": 1,
            "userName": "paddle365",
            "firstName": "John",
            "lastName": "Doe",
            "email": "paddleFast@g.com",
            "password": 5678
        },
        {
            "id": 2,
            "userName": "riverJunkie",
            "firstName": "Carl",
            "lastName": "Sanders",
            "email": "fishing365@river.com",
            "password": 9876
        },
        {
            "id": 3,
            "userName": "swimmingHole",
            "firstName": "Spud",
            "lastName": "Nicholas",
            "email": "swimmer4life@pools.com",
            "password": 9876
        }
    ],
    "locations": [
        {
            "id": 1,
            "locationName": "Duck River",
            "locationDetails": "The Duck River is just over 270 miles in length. It is one of the longest rivers contained entirely within the Tennessee borders and showcases scenic pastoral lands, steep rock cliffs, and forested banks.",
            "riverClass": "Class I river for its entire length.",
            "history": "The Duck River is one of the most biologically rich and diverse rivers in North America. In 2001, a 37-mile stretch of the Duck River was designated a State Scenic River because of its scenic, ecological, cultural, and historical value."
        },
        {
            "id": 2,
            "locationName": "Harpeth River",
            "locationDetails": "The Harpeth River is 125 miles in length and originates in Eagleville, TN. It has several natural, archaeological and historic areas.",
            "riverClass": "Class I river for its entire length.",
            "history": "The Harpeth's name origin is inconclusive, but one thought is that it came from the Harpe brothers, outlaws in the 1790s. The first pedestrian bridge in Franklin was built in 1819 near the present Harpeth River/Columbia Pike bridge location."
        },
        {
            "id": 3,
            "locationName": "Buffalo River",
            "locationDetails": "The Buffalo River is the longest un-impounded river in Middle Tennessee, flowing 125 miles through the southwestern portion of Middle Tennessee.",
            "riverClass": "Class I river, but has numerous faster sections with twist and turns in the river.",
            "history": "The Buffalo River is the longest wild river in the United States, which means there are no impediments on the river, such as damns. It has been designated as a State Scenic River under the Tennessee Wild and Scenic Rivers Act."
        },
        {
            "id": 4,
            "locationName": "Caney Fork River",
            "locationDetails": "The Caney Fork is 144 miles long and rises in Cumberland County about six miles northwest of Crossville. Known for its beauty and peacefulness, also known for its Rainbow and Brown Trout fishing.",
            "riverClass": "Class I river.",
            "history": "The Caney Fork in Middle Tennessee was noted for its pearl-bearing mussels, and “pearling” was a favorite sport on Sunday afternoons at the turn of the century. After World War I, dams were built on many of the rivers, and the mussels lost their swift and shallow shoals."
        },
        {
            "id": 5,
            "locationName": "Elk River",
            "locationDetails": "The Elk River is 195 miles long and begins below Tims Ford Lake. It's a clear, cold river just below the dam, making it a favorite spot for fisherman. ",
            "riverClass": "Class I river.",
            "history": "There are actually two Elk Rivers in Tennessee, the smaller of which is located in northeast Tennessee. This Elk River flows from the back side of Beech Mountain, North Carolina through Carter County, Tennessee and empties into Watauga Lake."
        },
        {
            "id": 6,
            "locationName": "Piney River",
            "locationDetails": "The Piney River is a beautiful 24 mile river that flows into the Duck River. It features gorgeous rock bluffs, clear water, and pretty gravel bars.",
            "riverClass": "It is a class I river, but can have river hazards such as strainers and sweepers.",
            "history": "Piney gorge region is home to one of the world's most biodiverse ecosystems. Rare species such as Tangerine Darters, Hellbenders and Purple Bean Mollusks all live in and around the Piney watershed."
        },
        {
            "id": 7,
            "locationName": "Red River",
            "locationDetails": "The Red River is 100 miles long and is a major tributary to the Cumberland River. It is a moderately shallow river with sandy beaches and a rock bottom.",
            "riverClass": " Class I and II river with a few fast spots.",
            "history": "The Red River in Tennessee is known for its Small Mouth Bass and Red Eye bass. In addition a seasonal migration of Striped Bass is becoming a popular fishery in the lower sections near the confluence with the Cumberland River. The Red River was the location for many historical events that took place during the founding of the Cumberland Settlement and Tennessee. Many confrontations between Native American People and Pioneers took place along it’s banks."
        }
    ],
    "activities": [
        {
            "id": 1,
            "description": "Canoeing, Fishing, Kayaking, and Hiking",
            "locationId": 1
            
        },
        {
            "id": 2,
            "description": "Kayaking, Canoeing, Fishing and Hiking. ",
            "locationId": 2
        },
        {
            "id": 3,
            "description": "Canoeing, Fishing, Kayaking, and Camping",
            "locationId": 3
        },
        {
            "id": 4,
            "description": "Canoeing, Fishing, Kayaking, Camping, and Swimming",
            "locationId": 4
        },
        {
            "id": 5,
            "description": "Canoeing, Fishing, Kayaking, Wildlife watching, and picnicking.",
            "locationId": 5
        },
        {
            "id": 6,
            "description": "Canoeing, Fishing, Kayaking, Swimming, and Camping",
            "locationId": 6
        },
        {
            "id": 7,
            "description": "Canoeing, Fishing, Kayaking, Swimming, and Camping",
            "locationId": 7
        }
    ]
}